<template>
    <div class="faq__container">
        <h1>Абсолютно честно</h1>
        <p>
            Перед каждой игрой генерирутеся строка алгоритмом SHA-512 в которой содержится соль и победное число (от 0 до 999999). Можно сказать, что перед Вами зашифрованный исход данной игры. Метод гарантирует 100% честность, так как результат игры Вы видите заранее, а при изменении победного числа приведет к изменению Hash. <br><br>

Проверяйте самостоятельно:<br>
Скоприруйте Hash до начала игры<br>
После окончания нажмите "Проверить игру"<br>
Откроется окно с результатом<br>>
Скопируйте вручную поля Salt1, Number (Победное число), Salt2 или нажмите кнопку "Скопировать"<br>
Вставьте в любой независимый SHA-512 генератор (Например: Ссылка 1 Ссылка 2 Ссылка 3)<br>
Hash должен совпадать c Hash до начала игры<br><br>
Например:<br><br>
Hash до начала игры: cdbe74ade59f5b8e3372c1e107ca8d343da9efa1a173ba6bc678daa28b586b25a7c2e39a71badf7f00e04b5c1dbc43532b92a1f2913b0540f490968d7ce883fe <br>
После окончания нажали на "Проверить игру", открылось окно <br>
Копируем значения Salt1, Number (Победное число), Salt2 <br>
Получаем строку 8{93mW8huq|995544|a5cm28bjA0 <br>
Вставляем строку в генератор <br>
Получили hash как и до начала игры <br>
        </p>
    </div>
</template>

<script></script>

<style scoped lang="scss">
    .faq__container{
        margin: 0 auto;
        max-width: 600px;
        min-width: 300px;
        p{
            color: white;
        }
        h1{
            color: white;
        }
    }

</style>